views/site/photographer.php

            		<?php
        		$id= $_GET['id'];
                $i = 0;
        		$photo = PhotographerSkill::find()->where(['id_skill'=>$id])->all();
---
SELECT * FROM `photographer_skill` WHERE `id_skill`='1'